MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DX256VLK7/mcu.h
#define WFP                           0x00780000      // Write FIFO Pointer
#define RFP                           0x00000078      // Read FIFO Pointer
#define WFP                           0x00780000      // FIFO write pointer for receive data channel
#define RFP                           0x00000078      // FIFO read pointer for receive data channel


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RMR register.
//
//*****************************************************************************

#define RWM                           0x7FFFFFFF80000000      // Receive Word Mask
#define RWM                           0x7FFFFFFF80000000      // Receive Word Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MCR register.
//
//*****************************************************************************

#define DUF                           0x80000000      // Divider Update Flag
#define MOE                           0x40000000      // MCLK Output Enable
#define MICS                          0x06000000      // MCLK Input Clock Select
#define DUF                           0x80000000      // Divider Update Flag
#define MOE                           0x40000000      // MCLK Output Enable
#define MICS                          0x06000000      // MCLK Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MDR register.
//
//*****************************************************************************

#define DIVIDE                        0x7FFFF80000      // 
#define FRACT                         0x00780000      //  ::
#define FRACT                         0x07F80000      // Fractional divider value
#define DIVIDE                        0x007FF800      // Integer divider value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDOR register.
//
//*****************************************************************************

#define PDO                           0x7FFFFFFF80000000      // Port Data Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PSOR register.
//
//*****************************************************************************

#define PTSO                          0x7FFFFFFF80000000      // Port Set Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PCOR register.
//
//*****************************************************************************

#define PTCO                          0x7FFFFFFF80000000      // Port Clear Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PTOR register.
//
//*****************************************************************************

#define PTTO                          0x7FFFFFFF80000000      // Port Toggle Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDIR register.
//
//*****************************************************************************

#define PDI                           0x7FFFFFFF80000000      // Port Data Input


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDDR register.
//
//*****************************************************************************

#define PDD                           0x7FFFFFFF80000000      // Port Data Direction


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_GENCS register.
//
//*****************************************************************************

#define LPCLKS                        0x10000000      // Low-Power Mode Clock Source Selection
#define LPSCNITV                      0x78000000      // TSI Low-Power Mode Scan Interval
#define NSCN                          0x0F800000      // Number of Consecutive Scans Per Electrode Electrode
#define PS                            0x001C0000      // Electrode Oscillator Prescaler
#define EOSF                          0x00008000      // End of Scan Flag
#define OUTRGF                        0x00004000      // Out of Range Flag
#define EXTERF                        0x00002000      // External Electrode Error Occurred
#define OVRF                          0x00001000      // Overrun Error Flag
#define SCNIP                         0x00000200      // Scan In Progress Status
#define SWTS                          0x00000100      // Software Trigger Start
#define TSIEN                         0x00000080      // Touch Sensing Input Module Enable
#define TSIIE                         0x00000040      // Touch Sensing Input Interrupt Module Enable
#define ERIE                          0x00000020      // Error Interrupt Enable
#define ESOR                          0x00000010      // End-of-Scan Or Out-of-Range Interrupt Select
#define STM                           0x00000004      // Scan Trigger Mode
#define STPE                          0x00000001      // TSI STOP Enable while in low-power modes (STOP, VLPS, LLS, and VLLS{3,2,1})


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_SCANC register.
//
//*****************************************************************************

#define REFCHRG                       0x78000000      // Ref OSC Charge Current Select
#define EXTCHRG                       0x07800000      // External OSC Charge Current Select
#define SMOD                          0x007F8000      // Scan Module
#define AMCLKS                        0x00000030      // Active Mode Clock Source
#define AMPSC                         0x0000001C      // Active Mode Prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_PEN register.
//
//*****************************************************************************

#define LPSP                          0x00780000      // Low-Power Scan Pin
#define PEN15                         0x00008000      // Touch Sensing Input Pin Enable Register 15
#define PEN14                         0x00004000      // Touch Sensing Input Pin Enable Register 14
#define PEN13                         0x00002000      // Touch Sensing Input Pin Enable Register 13
#define PEN12                         0x00001000      // Touch Sensing Input Pin Enable Register 12
#define PEN11                         0x00000800      // Touch Sensing Input Pin Enable Register 11
#define PEN10                         0x00000400      // Touch Sensing Input Pin Enable Register 10
#define PEN9                          0x00000200      // Touch Sensing Input Pin Enable Register 9
#define PEN8                          0x00000100      // Touch Sensing Input Pin Enable Register 8
#define PEN7                          0x00000080      // Touch Sensing Input Pin Enable Register 7
#define PEN6                          0x00000040      // Touch Sensing Input Pin Enable Register 6
#define PEN5                          0x00000020      // Touch Sensing Input Pin Enable Register 5
#define PEN4                          0x00000010      // Touch Sensing Input Pin Enable Register 4
#define PEN3                          0x00000008      // Touch Sensing Input Pin Enable Register 3
#define PEN2                          0x00000004      // Touch Sensing Input Pin Enable Register 2
#define PEN1                          0x00000002      // Touch Sensing Input Pin Enable Register 1
#define PEN0                          0x00000001      // Touch Sensing Input Pin Enable Register 0


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_WUCNTR register.
//
//*****************************************************************************

#define WUCNT                         0x7FFF8000      // Touch Sensing Wake-Up Channel 16-bit Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_CNTRn register.
//
//*****************************************************************************

#define CTN                           0x7FFF80000000      // Touch Sensing Channel n 16-bit Counter Value
#define CTN1                          0x7FFF8000      // Touch Sensing Channel n-1 16-bit Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_THRESHOLD register.
//
//*****************************************************************************

#define LTHH                          0x7FFF80000000      // Touch Sensing Channel Low Threshold Value
#define HTHH                          0x7FFF8000      // Touch Sensing Channel High Threshold Value



#endif // __MK10DX256VLK7_H__

